NetSuiteWebhook/NetSuiteWebhook/Files/NS_FU/Fusion/CreditApplyARInvoice/Request/CreateCreditARSample.xml


<soapenv:Envelope xmlns:cmap="http://xmlns.oracle.com/apps/flex/financials/receivables/transactions/creditMemos/creditMemoService/CMApplicationDff/" xmlns:cred="http://xmlns.oracle.com/apps/financials/receivables/transactions/creditMemos/creditMemoService/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/receivables/transactions/creditMemos/creditMemoService/types/">
	<soapenv:Body>
		<typ:createApplyOnAccountCreditMemo>
			<typ:applyOnAccountCreditMemo>
				<cred:BusinessUnit>Dusters Total Solutions Services Pvt. Ltd.</cred:BusinessUnit>
				<cred:CreditMemoTrxNumber>17910202003CM</cred:CreditMemoTrxNumber>
				<cred:InvoiceTrxNumber>22003</cred:InvoiceTrxNumber>
				<cred:AmountApplied>100</cred:AmountApplied>
				<cred:ApplyDate>2020-10-22</cred:ApplyDate>
				<cred:GlDate>2020-10-22</cred:GlDate>
				<cred:InvoiceLineNumber>1</cred:InvoiceLineNumber>
				<cred:Comments>SOAP API APPLY</cred:Comments>
			</typ:applyOnAccountCreditMemo>
		</typ:createApplyOnAccountCreditMemo>
	</soapenv:Body>
</soapenv:Envelope>